[
    {
      "bookId": 1,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/To_Kill_a_Mockingbird_%28first_edition_cover%29.jpg/388px-To_Kill_a_Mockingbird_%28first_edition_cover%29.jpg",
      "review": "Set in the fictional town of Maycomb, Alabama, during the Great Depression, To Kill a Mockingbird follows the journey of young Scout Finch as she witnesses her father's defense of Tom Robinson, a black man accused of raping a white woman. Through Scout's eyes, the novel explores themes of racial injustice, moral growth, and the loss of innocence.",
      "totalPages": 336,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["Drama", "Coming-of-age"],
      "publisher": "J. B. Lippincott & Co.",
      "yearOfPublishing": 1960
    },
    {
      "bookId": 2,
      "bookName": "1984",
      "author": "George Orwell",
      "image": "https://th.bing.com/th/id/OIP.oRoF-fLJQ1nqPtFwUiiGcQAAAA?rs=1&pid=ImgDetMain",
      "review": " 1984 depicts a dystopian world where totalitarianism reigns supreme and individual freedoms are suppressed. The novel follows Winston Smith, a low-ranking member of the ruling Party, as he rebels against the oppressive regime led by Big Brother. Through Winston's journey, Orwell explores themes of surveillance, propaganda, and the nature of truth.",
      "totalPages": 328,
      "rating": 4.7,
      "category": "Science Fiction",
      "tags": ["Dystopian", "Political"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
    },
    {
      "bookId": 3,
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://upload.wikimedia.org/wikipedia/commons/7/7a/The_Great_Gatsby_Cover_1925_Retouched.jpg",
      "review": " The Great Gatsby is a quintessential American novel set in the Roaring Twenties, a time of unprecedented prosperity and social upheaval. Through the eyes of narrator Nick Carraway, the novel follows the mysterious millionaire Jay Gatsby as he pursues the love of his life, Daisy Buchanan. Fitzgerald's masterful prose explores themes of love, wealth, and the American Dream.",
      "totalPages": 180,
      "rating": 4.3,
      "category": "Fiction",
      "tags": ["Romance", "Tragedy"],
      "publisher": "Charles Scribner's Sons",
      "yearOfPublishing": 1925
    },
    {
      "bookId": 4,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://th.bing.com/th/id/R.d0cfb06a262c92c78d4905e7f820db64?rik=DmvvZyZKVLp2Jg&pid=ImgRaw&r=0",
      "review": "Pride and Prejudice is a beloved romantic novel that follows the tumultuous relationship between Elizabeth Bennet and Mr. Darcy in early 19th-century England. Jane Austen's sharp wit and keen observations of society are on full display as she explores themes of love, marriage, and social class.",
      "totalPages": 279,
      "rating": 4.6,
      "category": "Romance",
      "tags": ["Regency", "Social Commentary"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
    },
    {
      "bookId": 5,
      "bookName": "The Catcher in the Rye",
      "author": "J. D. Salinger",
      "image": "https://th.bing.com/th/id/R.cac52fbbefa83812774f681dbf874163?rik=v%2bHq2yBp%2f6RzYw&riu=http%3a%2f%2fmedia.npr.org%2fassets%2fbakertaylor%2fcovers%2fc%2fcatcher-in-the-rye%2f9780316769488_custom-b6fc2e108f3865eb320720875c20e4f869da8065-s6-c30.jpg&ehk=fpDBmQJbSuHhhoBl2AYOifBz0QLtjPI7FBgIYnU65cM%3d&risl=&pid=ImgRaw&r=0",
      "review": "The Catcher in the Rye is a seminal coming-of-age novel that follows the disillusioned teenager Holden Caulfield as he navigates the complexities of adolescence and society. J.D. Salinger's poignant portrayal of alienation and rebellion has made the novel a timeless classic.",
      "totalPages": 224,
      "rating": 4.4,
      "category": "Fiction",
      "tags": ["Coming-of-age", "Teen"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
    },
    {
      "bookId": 6,
      "bookName": "The Philosopher's Stone",
      "author": "J.K. Rowling",
      "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1598823299i/42844155.jpg",
      "review": "The Philosopher's Stone is the first book in the Harry Potter series, which follows the adventures of young wizard Harry Potter as he attends Hogwarts School of Witchcraft and Wizardry. J.K. Rowling's imaginative world-building and captivating storytelling have made the series a global phenomenon.",
      "totalPages": 223,
      "rating": 4.8,
      "category": "Fantasy",
      "tags": ["Magic", "Adventure", "World"],
      "publisher": "Bloomsbury Publishing",
      "yearOfPublishing": 1997
    },
    {
      "bookId": 7,
      "bookName": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "https://th.bing.com/th/id/OIP._AWQua901tukexSsdbr6IgHaLH?rs=1&pid=ImgDetMain",
      "review": "The Hobbit is a charming fantasy novel that precedes The Lord of the Rings series. The story follows Bilbo Baggins, a hobbit who is whisked away on an unexpected adventure by the wizard Gandalf and a group of dwarves led by Thorin Oakenshield. Along the way, they encounter trolls, goblins, and dragons as they journey to reclaim the Lonely Mountain and its treasure. J.R.R. Tolkien's enchanting tale of adventure, friendship, and heroism in Middle-earth has captivated readers of all ages for generations.",
      "totalPages": 310,
      "rating": 4.7,
      "category": "Fantasy",
      "tags": ["Adventure", "Epic"],
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1937
    },
    {
      "bookId": 8,
      "bookName": "The Lord of the Rings",
      "author": "J.R.R. Tolkien",
      "image": "https://th.bing.com/th/id/R.b47fbb1fb812209e04ecd4908625b5b8?rik=4Q%2f1QkNQI%2flqsA&pid=ImgRaw&r=0",
      "review": "The Lord of the Rings is a monumental epic fantasy series that follows the quest to destroy the One Ring and defeat the dark lord Sauron. The trilogy consists of three volumes: The Fellowship of the Ring, The Two Towers, and The Return of the King. Set in the richly imagined world of Middle-earth, the story spans continents and chronicles the struggles of various characters, including Frodo Baggins, Aragorn, Gandalf, and Legolas, against the forces of evil. J.R.R. Tolkien's magnum opus is celebrated for its intricate world-building, compelling characters, and timeless themes of courage, friendship, and sacrifice.",
      "totalPages": 1178,
      "rating": 4.9,
      "category": "Fantasy",
      "tags": ["Adventure", "Epic", "Magic"],
      "publisher": "Allen & Unwin",
      "yearOfPublishing": 1954
    },
    {
      "bookId": 9,
      "bookName": "The Da Vinci Code",
      "author": "Dan Brown",
      "image": "https://pictures.abebooks.com/inventory/11110526584.jpg",
      "review": " The Da Vinci Code is a gripping thriller that intertwines art history, religion, and conspiracy in a fast-paced and suspenseful narrative. When renowned symbologist Robert Langdon is summoned to the Louvre Museum to examine a mysterious murder scene, he becomes embroiled in a quest to unravel a centuries-old mystery involving the works of Leonardo da Vinci, secret societies, and hidden messages. As Langdon races against time to uncover the truth, he finds himself drawn into a web of deception and danger that challenges his beliefs and threatens his life.",
      "totalPages": 489,
      "rating": 4.2,
      "category": "Thriller",
      "tags": ["Mystery", "Conspiracy"],
      "publisher": "Doubleday",
      "yearOfPublishing": 2003
    },
    {
      "bookId": 10,
      "bookName": "The Alchemist",
      "author": "Paulo Coelho",
      "image": "https://th.bing.com/th/id/R.e1ed5015d3a55c6f61f6d9e872d13978?rik=j%2bG4yJe%2fl9M0Jg&pid=ImgRaw&r=0",
      "review": "The Alchemist is a philosophical novel that follows the journey of Santiago, a young Andalusian shepherd boy, as he embarks on a quest to fulfill his Personal Legend and find his true purpose in life. Along the way, Santiago encounters a series of characters and experiences that test his courage, resilience, and faith in the universe. Paulo Coelho's lyrical prose and profound insights into the human condition make The Alchemist a timeless meditation on destiny, dreams, and the transformative power of self-discovery.",
      "totalPages": 197,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["Philosophical", "Inspirational"],
      "publisher": "HarperCollins",
      "yearOfPublishing": 1988
    },
    {
      "bookId": 11,
      "bookName": "The Hunger Games",
      "author": "Suzanne Collins",
      "image": "https://upload.wikimedia.org/wikipedia/en/3/39/The_Hunger_Games_cover.jpg",
      "review": "The Hunger Games is a thrilling dystopian novel set in a post-apocalyptic world where the remnants of North America are divided into twelve districts ruled by the oppressive Capitol. Each year, one boy and one girl from each district are selected to participate in the Hunger Games, a televised competition where they must fight to the death until only one survivor remains. When Katniss Everdeen volunteers to take her sister's place in the Games, she becomes a symbol of defiance against the Capitol's tyranny and sparks a rebellion that will change Panem forever. Suzanne Collins' gripping tale of survival, sacrifice, and revolution has captivated readers worldwide with its compelling characters and thought-provoking themes.",
      "totalPages": 374,
      "rating": 4.3,
      "category": "Science Fiction",
      "tags": ["Dystopian", "Action"],
      "publisher": "Scholastic Corporation",
      "yearOfPublishing": 2008
    },
    {
      "bookId": 12,
      "bookName": "The Road",
      "author": "Cormac McCarthy",
      "image": "https://imgv2-2-f.scribdassets.com/img/word_document/90940191/original/c7825c6f4b/1587814704?v=1",
      "review": " The Road is a post-apocalyptic novel that follows the harrowing journey of a father and his young son as they traverse a desolate and dangerous landscape in search of safety and salvation. In a world ravaged by an unspecified cataclysm, where ash falls like snow and the sun is obscured by clouds of dust, the pair must confront the worst aspects of human nature while clinging to their humanity and hope for a better future. Cormac McCarthy's spare and haunting prose captures the bleakness and beauty of their odyssey, offering a stark meditation on survival, love, and the enduring power of the human spirit in the face of adversity.",
      "totalPages": 287,
      "rating": 4.4,
      "category": "Fiction",
      "tags": ["Dystopian", "Survival"],
      "publisher": "Alfred",
      "yearOfPublishing": 2008
    }
]